### Importing the Libraries

In [1]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
from sklearn.model_selection import train_test_split

### Loading the data

In [2]:
aisles = pd.read_csv('aisles.csv')
departments = pd.read_csv('departments.csv')
order_products_prior = pd.read_csv('order_products__prior.csv',nrows=50000)
order_products_train = pd.read_csv('order_products__train.csv',nrows=50000)
orders = pd.read_csv('orders.csv')
products = pd.read_csv('products.csv')

### Merging the tables(order_products_prior, orders, products, aisles, departments)

In [3]:
#https://www.geeksforgeeks.org/python-merge-join-and-concatenate-dataframes-using-panda/

merged_df_1 = pd.merge(order_products_train, orders, on = 'order_id', how='left')

In [4]:
merged_df_2 = pd.merge(order_products_prior, orders, on='order_id', how='left')

In [5]:
merged_df_1.shape

(50000, 10)

In [6]:
merged_df_2.shape

(50000, 10)

### Top 5 rows

In [7]:
merged_df_1.head()

,order_id,product_id,add_to_cart_order,reordered,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,1,49302,1,1,112108,train,4,4,10,9.0
1,1,11109,2,1,112108,train,4,4,10,9.0
2,1,10246,3,0,112108,train,4,4,10,9.0
3,1,49683,4,0,112108,train,4,4,10,9.0
4,1,43633,5,1,112108,train,4,4,10,9.0

In [8]:
merged_df_2.head()

,order_id,product_id,add_to_cart_order,reordered,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2,33120,1,1,202279,prior,3,5,9,8.0
1,2,28985,2,1,202279,prior,3,5,9,8.0
2,2,9327,3,0,202279,prior,3,5,9,8.0
3,2,45918,4,1,202279,prior,3,5,9,8.0
4,2,30035,5,0,202279,prior,3,5,9,8.0

### Vertically stacking the data

In [9]:
df_merged = pd.concat([merged_df_1,merged_df_2],ignore_index=True)

In [10]:
df_merged.shape

(100000, 10)

In [11]:
df_merged.head()

,order_id,product_id,add_to_cart_order,reordered,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,1,49302,1,1,112108,train,4,4,10,9.0
1,1,11109,2,1,112108,train,4,4,10,9.0
2,1,10246,3,0,112108,train,4,4,10,9.0
3,1,49683,4,0,112108,train,4,4,10,9.0
4,1,43633,5,1,112108,train,4,4,10,9.0

In [12]:
df_merged.tail()

,order_id,product_id,add_to_cart_order,reordered,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
99995,5280,40592,10,0,40270,prior,2,3,16,30.0
99996,5281,24852,1,1,179342,prior,47,5,13,3.0
99997,5281,28204,2,1,179342,prior,47,5,13,3.0
99998,5281,21137,3,1,179342,prior,47,5,13,3.0
99999,5281,14947,4,1,179342,prior,47,5,13,3.0

### Seprating the features and labels

In [13]:
y = df_merged['reordered']
x = df_merged.drop(['reordered'],axis=1)

### Checking the null values

In [14]:
x.isnull().sum()

order_id                     0
product_id                   0
add_to_cart_order            0
user_id                      0
eval_set                     0
order_number                 0
order_dow                    0
order_hour_of_day            0
days_since_prior_order    3024
dtype: int64

### Replacing null values with the mean of the column

In [15]:
int_mean = x['days_since_prior_order'].mean()
int_mean = round(int_mean)

In [16]:
x['days_since_prior_order'] = x['days_since_prior_order'].fillna(int_mean)

In [17]:
x['days_since_prior_order'].value_counts()

30.0    18641
7.0      9521
6.0      7082
14.0     6675
5.0      5463
8.0      5135
4.0      4503
3.0      4204
9.0      3623
2.0      3365
10.0     2770
12.0     2701
13.0     2683
11.0     2461
15.0     2268
1.0      1995
21.0     1757
16.0     1553
20.0     1321
0.0      1310
17.0     1236
18.0     1236
22.0     1209
19.0     1159
28.0     1065
27.0     1063
26.0      897
23.0      840
25.0      828
24.0      792
29.0      644
Name: days_since_prior_order, dtype: int64

In [21]:
x.head()

,order_id,product_id,add_to_cart_order,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,1,49302,1,112108,train,4,4,10,9.0
1,1,11109,2,112108,train,4,4,10,9.0
2,1,10246,3,112108,train,4,4,10,9.0
3,1,49683,4,112108,train,4,4,10,9.0
4,1,43633,5,112108,train,4,4,10,9.0

In [25]:
x.pivot_table()

      user_id  product_id
0          30           1
1          55          13
2          56           9
3          66          12
4          79          10
...       ...         ...
9484   206140          11
9485   206162           8
9486   206177           6
9487   206184           1
9488   206206           4

[9489 rows x 2 columns]

### Splitting the data into train, cv and test

In [18]:
x_train, x_cv, y_train, y_cv = train_test_split(x, y, test_size=0.2, random_state=42)
x_train, x_test, y_train, y_test = train_test_split(x_train, y_train, test_size=0.2, random_state=42)

### Shape of train, cv and test data

In [19]:
print(x_train.shape, y_train.shape)
print(x_cv.shape, y_cv.shape)
print(x_test.shape, y_test.shape)

(64000, 9) (64000,)
(20000, 9) (20000,)
(16000, 9) (16000,)